Ran Plan for dir: `infra/gcp/terraform/k8s-staging-images` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.artifact_registry["charts"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/charts"
        name                   = "charts"
      ~ update_time            = "2024-12-06T15:33:54.572945Z" -> "2025-01-03T18:58:03.944142Z"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["cloud-provider-kind"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/cloud-provider-kind"
        name                   = "cloud-provider-kind"
      ~ update_time            = "2024-11-25T21:04:11.526859Z" -> "2024-12-20T12:17:06.334981Z"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["csi-vsphere"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/csi-vsphere"
        name                   = "csi-vsphere"
      ~ update_time            = "2024-12-05T20:52:14.327242Z" -> "2025-01-03T10:40:07.797496Z"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["etcd-manager"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/etcd-manager"
        name                   = "etcd-manager"
      ~ update_time            = "2024-12-02T21:07:31.873341Z" -> "2024-12-27T19:28:34.420339Z"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["kueue"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/kueue"
        name                   = "kueue"
      ~ update_time            = "2024-12-06T15:32:42.661798Z" -> "2025-01-03T19:18:01.054362Z"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # module.artifact_registry["gateway-api-inference-extension"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us-central1"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-staging-images"
      + repository_id          = "gateway-api-inference-extension"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-90-days"

          + condition {
              + older_than            = "7776000s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
            }
        }
    }

  # module.artifact_registry["gateway-api-inference-extension"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-central1"
      + member     = "allUsers"
      + project    = "k8s-staging-images"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["gateway-api-inference-extension"].google_artifact_registry_repository_iam_member.writers["group:sig-apps-leads@kubernetes.io"] will be created
+ resource "google_artifact_registry_repository_iam_member" "writers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-central1"
      + member     = "group:sig-apps-leads@kubernetes.io"
      + project    = "k8s-staging-images"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # module.artifact_registry["llm-instance-gateway"].google_artifact_registry_repository.repo will be destroyed
  # (because module.artifact_registry["llm-instance-gateway"] is not in configuration)
- resource "google_artifact_registry_repository" "repo" {
      - cleanup_policy_dry_run = false -> null
      - create_time            = "2024-11-24T15:13:02.377922Z" -> null
      - effective_labels       = {} -> null
      - format                 = "DOCKER" -> null
      - id                     = "projects/k8s-staging-images/locations/us-central1/repositories/llm-instance-gateway" -> null
      - labels                 = {} -> null
      - location               = "us-central1" -> null
      - mode                   = "STANDARD_REPOSITORY" -> null
      - name                   = "llm-instance-gateway" -> null
      - project                = "k8s-staging-images" -> null
      - repository_id          = "llm-instance-gateway" -> null
      - terraform_labels       = {} -> null
      - update_time            = "2025-01-04T00:24:49.280174Z" -> null

      - cleanup_policies {
          - action = "DELETE" -> null
          - id     = "delete-images-older-than-90-days" -> null

          - condition {
              - older_than            = "7776000s" -> null
              - package_name_prefixes = [] -> null
              - tag_prefixes          = [] -> null
              - tag_state             = "ANY" -> null
              - version_name_prefixes = [] -> null
            }
        }
    }

  # module.artifact_registry["llm-instance-gateway"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be destroyed
  # (because module.artifact_registry["llm-instance-gateway"] is not in configuration)
- resource "google_artifact_registry_repository_iam_member" "readers" {
      - etag       = "BwYnqg30B5k=" -> null
      - id         = "projects/k8s-staging-images/locations/us-central1/repositories/llm-instance-gateway/roles/artifactregistry.reader/allUsers" -> null
      - location   = "us-central1" -> null
      - member     = "allUsers" -> null
      - project    = "k8s-staging-images" -> null
      - repository = "projects/k8s-staging-images/locations/us-central1/repositories/llm-instance-gateway" -> null
      - role       = "roles/artifactregistry.reader" -> null
    }

  # module.artifact_registry["llm-instance-gateway"].google_artifact_registry_repository_iam_member.writers["group:sig-apps-leads@kubernetes.io"] will be destroyed
  # (because module.artifact_registry["llm-instance-gateway"] is not in configuration)
- resource "google_artifact_registry_repository_iam_member" "writers" {
      - etag       = "BwYnqg30B5k=" -> null
      - id         = "projects/k8s-staging-images/locations/us-central1/repositories/llm-instance-gateway/roles/artifactregistry.writer/group:sig-apps-leads@kubernetes.io" -> null
      - location   = "us-central1" -> null
      - member     = "group:sig-apps-leads@kubernetes.io" -> null
      - project    = "k8s-staging-images" -> null
      - repository = "projects/k8s-staging-images/locations/us-central1/repositories/llm-instance-gateway" -> null
      - role       = "roles/artifactregistry.writer" -> null
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra/gcp/terraform/k8s-staging-images
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.k8s.io/lock?id=kubernetes%252Fk8s.io%252Finfra%252Fgcp%252Fterraform%252Fk8s-staging-images%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra/gcp/terraform/k8s-staging-images
  ```

**Note: Objects have changed outside of Terraform**
Plan: 3 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```